app/controllers/trails_controller.rb

  def index
    @trails = Trail.all
---
SELECT "trails".* FROM "trails"

  def create
    @trail = Trail.new(trail_params)

    respond_to do |format|
      if @trail.save
---
INSERT INTO "trails" ("trailname", "image", "coordinates", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trailname", ""], ["image", ""], ["coordinates", ""], ["created_at", "2016-07-19 19:19:17.571650"], ["updated_at", "2016-07-19 19:19:17.571650"]]

  def destroy
    @trail.destroy
---
DELETE FROM "trails" WHERE "trails"."id" = $1  [["id", 1]]

    def set_trail
      @trail = Trail.find(params[:id])
---
SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT 1  [["id", 1]]