app/controllers/trips_controller.rb

INSERT INTO "trips" ("tripname", "description", "start", "end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["tripname", "sdsd"], ["description", "sdsd"], ["start", "2016-07-20"], ["end", "2016-07-20"], ["created_at", "2016-07-20 00:47:13.334857"], ["updated_at", "2016-07-20 00:47:13.334857"]]
---
  def create
    @trip = Trip.new(trip_params)

    respond_to do |format|
      if @trip.save

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 1]]
---
  def destroy
    @trip.destroy

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_trip
      @trip = Trip.find(params[:id])